## 3. Fixing Incorrect Data Types (Advanced)
- Converting strings to numeric using `pd.to_numeric(errors="coerce")`
- Converting strings to dates (to_datetime)
- Detecting mixed-type columns
- Using regex-based cleanup before conversion

https://www.w3schools.com/python/python_regex.asp

## Mixed Data

In [2]:
import pandas as pd
import numpy as np

In [3]:
mx=pd.read_csv("data/mixed.csv")
mx.head()

  Cabin            Ticket number  Survived
0   NaN         A/5 21171      5         0
1   C85          PC 17599      3         1
2   NaN  STON/O2. 3101282      6         1
3  C123            113803      3         1
4   NaN            373450      A         0

In [4]:
mx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Cabin     204 non-null    object
 1   Ticket    891 non-null    object
 2   number    891 non-null    object
 3   Survived  891 non-null    int64
dtypes: int64(1), object(3)
memory usage: 28.0+ KB

In [5]:
mx["number_numerical"]=pd.to_numeric(mx["number"], errors="coerce", downcast='integer')

In [6]:
mx.head()

  Cabin            Ticket number  Survived  number_numerical
0   NaN         A/5 21171      5         0               5.0
1   C85          PC 17599      3         1               3.0
2   NaN  STON/O2. 3101282      6         1               6.0
3  C123            113803      3         1               3.0
4   NaN            373450      A         0               NaN

In [7]:
mx["number_categorical"]=np.where(mx["number_numerical"].isnull(), mx["number"], np.nan)
mx.head()

,Cabin,Ticket,number,Survived,number_numerical,number_categorical
0,NaN,A/5 21171,5,0,5.0,NaN
1,C85,PC 17599,3,1,3.0,NaN
2,NaN,STON/O2. 3101282,6,1,6.0,NaN
3,C123,113803,3,1,3.0,NaN
4,NaN,373450,A,0,NaN,A

In [8]:
mx["cabin_num"]=mx["Cabin"].str.extract('(\d)')
mx["cabin_cat"]=mx["Cabin"].str[0]

In [9]:
mx.head()

,Cabin,Ticket,number,Survived,number_numerical,number_categorical,cabin_num,cabin_cat
0,NaN,A/5 21171,5,0,5.0,NaN,NaN,NaN
1,C85,PC 17599,3,1,3.0,NaN,8,C
2,NaN,STON/O2. 3101282,6,1,6.0,NaN,NaN,NaN
3,C123,113803,3,1,3.0,NaN,1,C
4,NaN,373450,A,0,NaN,A,NaN,NaN

In [10]:
mx["Ticket_num"]=mx["Ticket"].apply(lambda s: s.split()[-1])
mx["Ticket_num"]=pd.to_numeric(mx["Ticket_num"], errors="coerce", downcast="integer")

mx["Ticket_cat"]=mx["Ticket"].apply(lambda s: s.split()[0])
mx["Ticket_cat"]=np.where(mx["Ticket_cat"].str.isdigit(), np.nan, mx["Ticket_cat"])

In [11]:
mx.head()

,Cabin,Ticket,number,Survived,number_numerical,number_categorical,cabin_num,cabin_cat,Ticket_num,Ticket_cat
0,NaN,A/5 21171,5,0,5.0,NaN,NaN,NaN,21171.0,A/5
1,C85,PC 17599,3,1,3.0,NaN,8,C,17599.0,PC
2,NaN,STON/O2. 3101282,6,1,6.0,NaN,NaN,NaN,3101282.0,STON/O2.
3,C123,113803,3,1,3.0,NaN,1,C,113803.0,NaN
4,NaN,373450,A,0,NaN,A,NaN,NaN,373450.0,NaN

In [12]:
# Datetime
date=pd.read_csv("data/orders.csv")
time=pd.read_csv("data/messages.csv")

In [13]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [14]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [15]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [16]:
# converting to datatime
date["date"]=pd.to_datetime(date["date"])
time["date"]=pd.to_datetime(time["date"])

In [17]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [18]:
date["date"].dt.day
# year month day

0      10
1      15
2      23
3      17
4       6
       ..
995     8
996     6
997     7
998     3
999    15
Name: date, Length: 1000, dtype: int32

In [19]:
date["month"]=date["date"].dt.month_name()
date["month"]

0      December
1        August
2       October
3        August
4       January
         ...
995     October
996    December
997         May
998       March
999     October
Name: month, Length: 1000, dtype: object

In [20]:
date["year"]=date["date"].dt.year
date.head()

        date  product_id  city_id  orders     month  year
0 2019-12-10        5628       25       3  December  2019
1 2018-08-15        3646       14     157    August  2018
2 2018-10-23        1859       25       1   October  2018
3 2019-08-17        7292       25       1    August  2019
4 2019-01-06        4344       25       3   January  2019

In [21]:
date["dow"]=date["date"].dt.dayofweek
date.head()

        date  product_id  city_id  orders     month  year  dow
0 2019-12-10        5628       25       3  December  2019    1
1 2018-08-15        3646       14     157    August  2018    2
2 2018-10-23        1859       25       1   October  2018    1
3 2019-08-17        7292       25       1    August  2019    5
4 2019-01-06        4344       25       3   January  2019    6

In [22]:
date["day"]=date["date"].dt.day_name()
date.head()

        date  product_id  city_id  orders     month  year  dow        day
0 2019-12-10        5628       25       3  December  2019    1    Tuesday
1 2018-08-15        3646       14     157    August  2018    2  Wednesday
2 2018-10-23        1859       25       1   October  2018    1    Tuesday
3 2019-08-17        7292       25       1    August  2019    5   Saturday
4 2019-01-06        4344       25       3   January  2019    6     Sunday

In [23]:
date["quarter"]=date['date'].dt.quarter
date["semester"]=np.where(date["quarter"].isin([1,2]), 1,2)
date.head()

,date,product_id,city_id,orders,month,year,dow,day,quarter,semester
0,2019-12-10,5628,25,3,December,2019,1,Tuesday,4,2
1,2018-08-15,3646,14,157,August,2018,2,Wednesday,3,2
2,2018-10-23,1859,25,1,October,2018,1,Tuesday,4,2
3,2019-08-17,7292,25,1,August,2019,5,Saturday,3,2
4,2019-01-06,4344,25,3,January,2019,6,Sunday,1,1

In [24]:
time.head()

                 date                                                msg
0 2013-12-15 00:50:00                           ищу на сегодня мужика 37
1 2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2 2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3 2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4 2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [25]:
time["hour"]=time["date"].dt.hour
time["min"]=time["date"].dt.minute
time.head()

,date,msg,hour,min
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11

In [26]:
time["date"].dt.time

0      00:50:00
1      23:40:00
2      00:21:00
3      00:31:00
4      23:11:00
         ...
995    00:50:00
996    23:14:00
997    23:37:00
998    23:34:00
999    23:25:00
Name: date, Length: 1000, dtype: object